## Importing Lib and Modules

In [41]:
import pandas as pd

## Reading Files

In [54]:
data = pd.read_csv('Palestine Body Count.csv')

In [55]:
data=data.rename(columns = {'Palestinians Injuries':'Palestinians_Injuries',
                                'Israelis Injuries':'Israelis_Injuries',
                               'Palestinians Killed':'Palestinians_Killed',
                                'Israelis Killed':'Israelis_Killed'})

In [56]:
backup = data.copy()

In [58]:
data = backup.copy()

In [59]:
data.fillna(0)

,Year,Month,Palestinians_Injuries,Israelis_Injuries,Palestinians_Killed,Israelis_Killed
0,2000.0,DECEMBER,781,0,51,8
1,2000.0,NOVEMBER,3838,0,112,22
2,2000.0,OCTOBER,5984,0,104,10
3,2000.0,SEPTEMBER,0,0,16,1
4,2001.0,DECEMBER,304,0,67,36
...,...,...,...,...,...,...
246,2021.0,MARCH,0,0,4,0
247,2021.0,APRIL,0,0,1,0
248,2021.0,MAY,0,0,26,3
249,0.0,0,0,0,0,0
250,0.0,0,"111,475","5,160","10,000","1,275"

In [49]:
backup['Total_Palestinians_Casualties'] = backup['Palestinians_Injuries']+ backup['Palestinians_Killed']

In [57]:
backup

,Year,Month,Palestinians_Injuries,Israelis_Injuries,Palestinians_Killed,Israelis_Killed
0,2000.0,DECEMBER,781,NaN,51,8
1,2000.0,NOVEMBER,3838,NaN,112,22
2,2000.0,OCTOBER,5984,NaN,104,10
3,2000.0,SEPTEMBER,NaN,NaN,16,1
4,2001.0,DECEMBER,304,NaN,67,36
...,...,...,...,...,...,...
246,2021.0,MARCH,NaN,NaN,4,0
247,2021.0,APRIL,NaN,NaN,1,0
248,2021.0,MAY,NaN,NaN,26,3
249,NaN,NaN,NaN,NaN,NaN,NaN
250,NaN,NaN,"111,475","5,160","10,000","1,275"

In [ ]:
df['DataFrame Column'] = df['DataFrame Column'].fillna(0)

In [ ]:
df.fillna(0)

In [22]:
backup['Month'].unique()

array(['DECEMBER', 'NOVEMBER', 'OCTOBER', 'SEPTEMBER', 'AUGUST', 'JULY',
       'JUNE', 'MAY', 'APRIL', 'MARCH', 'FEBRUARY', 'JANUARY', 'MAY ',
       nan], dtype=object)

In [18]:
backup["Palestinians_Injuries"].iloc[165]=0
backup["Israelis_Injuries"].iloc[165]=0
backup["Palestinians_Injuries"].iloc[203]=0
backup["Israelis_Injuries"].iloc[203]=0
backup["Month"].iloc[203]="MAY"

/home/perman/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [19]:
backup["Palestinians_Injuries"][165]

0

In [20]:
backup["Palestinians_Injuries"].iloc[165]

0

In [34]:
backup["Palestinians_Killed"]=backup["Palestinians_Killed"].apply(int)

ValueError: cannot convert float NaN to integer

In [23]:
backup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 7 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Year                           249 non-null    float64
 1   Month                          249 non-null    object
 2   Palestinians_Injuries          196 non-null    object
 3   Israelis_Injuries              133 non-null    object
 4   Palestinians_Killed            250 non-null    object
 5   Israelis_Killed                250 non-null    object
 6   Total_Palestinians_Casualties  196 non-null    object
dtypes: float64(1), object(6)
memory usage: 13.9+ KB

In [17]:
backup.describe()

              Year
count   249.000000
mean   2010.542169
std       6.014702
min    2000.000000
25%    2005.000000
50%    2011.000000
75%    2016.000000
max    2021.000000

## Data Frame created according to No Dead people

In [24]:
killing_data = pd.DataFrame()

In [27]:
killing_data = backup[['Year', 'Month', 'Palestinians_Killed','Israelis_Killed']].copy()

In [32]:
killing_data.drop(killing_data.index[249:251], inplace = True)

In [33]:
killing_data

       Year      Month Palestinians_Killed Israelis_Killed
0    2000.0   DECEMBER                  51               8
1    2000.0   NOVEMBER                 112              22
2    2000.0    OCTOBER                 104              10
3    2000.0  SEPTEMBER                  16               1
4    2001.0   DECEMBER                  67              36
..      ...        ...                 ...             ...
244  2021.0    JANUARY                   4               0
245  2021.0   FEBRUARY                   1               0
246  2021.0      MARCH                   4               0
247  2021.0      APRIL                   1               0
248  2021.0        MAY                  26               3

[249 rows x 4 columns]

In [40]:
killing_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 248
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year                 249 non-null    float64
 1   Month                249 non-null    object
 2   Palestinians_Killed  249 non-null    float64
 3   Israelis_Killed      249 non-null    float64
dtypes: float64(3), object(1)
memory usage: 9.7+ KB

In [39]:
killing_data["Palestinians_Killed"]=killing_data["Palestinians_Killed"].apply(float)
killing_data["Israelis_Killed"]=killing_data["Israelis_Killed"].apply(float)